In [73]:
import pandas as pd 
import sqlalchemy as sql
import _mysql_connector as my

In [74]:
df_air =pd.read_csv("D:/Airtel Prepaid.csv")
df_jio = pd.read_csv("D:/Jio - Jio Prepaid Planes.csv")

In [75]:
df_air.head()

   Price  Data_per_Day  Data  Days        Additional_Benefits
0   3359           2.5     0   365    Disney + Hotstar 1 year
1   2999           2.0     0   365                          0
2    999           2.5     0    84    Amazon prime membership
3    839           2.0     0    84  Disney + Hotstar 3 Months
4    719           1.5     0    84                          0

In [76]:
df_jio.head()

,Days,Price,Price_Day,For_365_Days,Profit_per_customer,From_400_Million_users,Data_per_day
0,28,209,7.464286,2724.464286,5.214286,2085.714286,1.0
1,24,179,7.458333,2722.291667,3.041667,1216.666667,1.0
2,20,149,7.450000,2719.250000,0.000000,0.000000,1.0
3,336,2545,7.574405,2764.657738,0.000000,0.000000,1.5
4,84,666,7.928571,2893.928571,129.270833,51708.333330,1.5

In [77]:
df_air.isnull().sum()

Price                  0
Data_per_Day           0
Data                   0
Days                   0
Additional_Benefits    0
dtype: int64

In [78]:
df_jio.isnull().sum()

Days                      0
Price                     0
Price_Day                 0
For_365_Days              0
Profit_per_customer       0
From_400_Million_users    0
Data_per_day              0
dtype: int64

In [79]:
df_air.dtypes

Price                    int64
Data_per_Day           float64
Data                     int64
Days                     int64
Additional_Benefits     object
dtype: object

In [80]:
df_jio.dtypes

Days                        int64
Price                       int64
Price_Day                 float64
For_365_Days              float64
Profit_per_customer       float64
From_400_Million_users    float64
Data_per_day              float64
dtype: object

In [81]:
df_jio.columns

Index(['Days', 'Price', 'Price_Day', 'For_365_Days', 'Profit_per_customer',
       'From_400_Million_users', 'Data_per_day'],
      dtype='object')

In [82]:
df_air.columns

Index(['Price', 'Data_per_Day', 'Data', 'Days', 'Additional_Benefits'], dtype='object')

In [83]:
df_air.duplicated().value_counts()

False    23
True      5
Name: count, dtype: int64

In [84]:
df_jio.duplicated().value_counts()

False    16
Name: count, dtype: int64

In [85]:

mysql_url = "mysql+mysqlconnector://root:Sudhan0311@localhost:3306/air_vs_jio"

# create SQLALchemy engine

engine = sql.create_engine(mysql_url)

# convert dataframe to SQL table 

df_jio.to_sql('jio_plans',con=engine, if_exists='replace',index=False)

16

In [86]:

mysql_url = "mysql+mysqlconnector://root:Sudhan0311@localhost:3306/air_vs_jio"

# create SQLALchemy engine

engine = sql.create_engine(mysql_url)

# convert dataframe to SQL table 

df_air.to_sql('airtel_plans',con=engine, if_exists='replace',index=False)

28

In [87]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [88]:
%sql mysql+mysqlconnector://root:Sudhan0311@localhost:3306/air_vs_jio

#### 1. Which Jio plans offer high-speed data (> 2GB/day)?

In [89]:
%%sql

SELECT Days, Price, Data_Per_day
FROM jio_plans
WHERE Data_Per_day > 2 ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
2 rows affected.

[(84, 1199, 3.0), (28, 419, 3.0)]

#### 2. Which Airtel plans are designed for long-term use (84 days or more)?

In [90]:
%%sql

SELECT Price, Days ,Data_per_Day
FROM airtel_plans
WHERE Days >= 84 ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
9 rows affected.

[(3359, 365, 2.5),
 (2999, 365, 2.0),
 (999, 84, 2.5),
 (839, 84, 2.0),
 (719, 84, 1.5),
 (455, 84, 0.0),
 (839, 84, 2.0),
 (3359, 365, 2.5),
 (1799, 365, 0.0)]

#### What are the "Budget-Friendly" options (under â‚¹300) available from both?

In [91]:
%%sql

SELECT 'Jio' AS Provider, Price, Days FROM jio_plans WHERE Price < 300
UNION ALL
SELECT 'Airtel' AS Provider, Price,Days FROM airtel_plans WHERE Price < 300;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
16 rows affected.

[('Jio', 209, 28),
 ('Jio', 179, 24),
 ('Jio', 149, 20),
 ('Jio', 259, 30),
 ('Jio', 239, 28),
 ('Jio', 199, 23),
 ('Jio', 119, 14),
 ('Jio', 299, 28),
 ('Jio', 249, 23),
 ('Airtel', 299, 28),
 ('Airtel', 296, 30),
 ('Airtel', 265, 28),
 ('Airtel', 239, 24),
 ('Airtel', 209, 21),
 ('Airtel', 179, 28),
 ('Airtel', 155, 24)]

#### 4. Does Airtel offer any plans with no daily data limit (bulk data only)?

In [92]:
%%sql

SELECT Price, Data, Days
FROM airtel_plans
WHERE Data_per_Day = 0 AND Data > 0;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
3 rows affected.

[(455, 6, 84), (296, 25, 30), (1799, 24, 365)]

#### 5. What are the standard "monthly" plans (exactly 28 days validity) for Jio?

In [93]:
%%sql

SELECT Days, Price, Data_per_Day
FROM jio_plans
WHERE Days = 28

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
4 rows affected.

[(28, 209, 1.0), (28, 239, 1.5), (28, 299, 2.0), (28, 419, 3.0)]

#### 6. Which Airtel plans include a free Disney+ Hotstar subscription?

In [94]:
%%sql

SELECT Price, Days, Additional_Benefits
FROM airtel_plans
WHERE Additional_Benefits LIKE '%Disney%' ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
10 rows affected.

[(3359, 365, 'Disney + Hotstar 1 year'),
 (839, 84, 'Disney + Hotstar 3 Months'),
 (599, 28, 'Disney + Hotstar 1 year'),
 (499, 28, 'Disney + Hotstar 1 year'),
 (399, 28, 'Disney + Hotstar 3 Months'),
 (399, 28, 'Disney + Hotstar 3 Months'),
 (839, 84, 'Disney + Hotstar 3 Months'),
 (499, 28, 'Disney + Hotstar 1 year'),
 (599, 28, 'Disney + Hotstar 1 year'),
 (3359, 365, 'Disney + Hotstar 1 year')]

#### 7. Which Airtel plans include a free Amazon Prime membership?

In [95]:
%%sql

SELECT Price, Days, Additional_Benefits
FROM airtel_plans
WHERE Additional_Benefits LIKE '%Amazon%' ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
2 rows affected.

[(999, 84, 'Amazon prime membership'), (699, 56, 'Amazon prime membership')]

#### 8. Which plans offer purely data/talktime with zero additional benefits?

In [96]:
%%sql

SELECT Price, Days, Additional_Benefits
FROM airtel_plans
WHERE Additional_Benefits = '0' OR Additional_Benefits IS NULL ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
10 rows affected.

[(2999, 365, '0'),
 (719, 84, '0'),
 (666, 77, '0'),
 (549, 56, '0'),
 (479, 56, '0'),
 (455, 84, '0'),
 (319, 30, '0'),
 (299, 28, '0'),
 (296, 30, '0'),
 (1799, 365, '0')]

#### 9. What is the actual "Cost per 1 GB of Data" for each Jio plan?

In [97]:
%%sql

SELECT 
     Price,
     Days,
     Data_per_day,
     ROUND(Price/ (Data_per_day * Days ), 2) AS Cost_Per_GB
FROM jio_plans
WHERE Data_per_day > 0
ORDER BY Cost_Per_GB ASC ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
16 rows affected.

[(2879, 365, 2.0, 3.94),
 (533, 56, 2.0, 4.76),
 (1199, 84, 3.0, 4.76),
 (419, 28, 3.0, 4.99),
 (2545, 336, 1.5, 5.05),
 (666, 84, 1.5, 5.29),
 (299, 28, 2.0, 5.34),
 (249, 23, 2.0, 5.41),
 (119, 14, 1.5, 5.67),
 (239, 28, 1.5, 5.69),
 (479, 56, 1.5, 5.7),
 (259, 30, 1.5, 5.76),
 (199, 23, 1.5, 5.77),
 (149, 20, 1.0, 7.45),
 (209, 28, 1.0, 7.46),
 (179, 24, 1.0, 7.46)]

#### 10. If we normalize to a 30-day cycle, what is the estimated monthly cost for Airtel?

In [98]:
%%sql

SELECT
     Price,
     Days,
     ROUND((Price / Days) * 30, 2) Est_Monthly_Cost
FROM airtel_plans ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
28 rows affected.

[(3359, 365, Decimal('276.08')),
 (2999, 365, Decimal('246.49')),
 (999, 84, Decimal('356.79')),
 (839, 84, Decimal('299.64')),
 (719, 84, Decimal('256.79')),
 (699, 56, Decimal('374.46')),
 (666, 77, Decimal('259.48')),
 (599, 28, Decimal('641.79')),
 (549, 56, Decimal('294.11')),
 (499, 28, Decimal('534.64')),
 (479, 56, Decimal('256.61')),
 (455, 84, Decimal('162.50')),
 (399, 28, Decimal('427.50')),
 (359, 28, Decimal('384.64')),
 (319, 30, Decimal('319.00')),
 (299, 28, Decimal('320.36')),
 (296, 30, Decimal('296.00')),
 (265, 28, Decimal('283.93')),
 (239, 24, Decimal('298.75')),
 (209, 21, Decimal('298.57')),
 (179, 28, Decimal('191.79')),
 (155, 24, Decimal('193.75')),
 (399, 28, Decimal('427.50')),
 (839, 84, Decimal('299.64')),
 (499, 28, Decimal('534.64')),
 (599, 28, Decimal('641.79')),
 (3359, 365, Decimal('276.08')),
 (1799, 365, Decimal('147.86'))]

#### 11. How can we categorize Jio plans into "Budget," "Standard," and "Premium"?

In [99]:
%%sql

SELECT 
     Price,
     CASE
         WHEN Price < 200 THEN 'Budget'
         WHEN Price BETWEEN 200 AND 600 THEN 'Standard'
         ELSE 'Premium'
    END AS Plan_Category
FROM jio_plans 
ORDER BY Price desc ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
16 rows affected.

[(2879, 'Premium'),
 (2545, 'Premium'),
 (1199, 'Premium'),
 (666, 'Premium'),
 (533, 'Standard'),
 (479, 'Standard'),
 (419, 'Standard'),
 (299, 'Standard'),
 (259, 'Standard'),
 (249, 'Standard'),
 (239, 'Standard'),
 (209, 'Standard'),
 (199, 'Budget'),
 (179, 'Budget'),
 (149, 'Budget'),
 (119, 'Budget')]

#### 12. If a user sticks to a single plan for a year, how much will they spend?

In [100]:
%%sql

SELECT 
     Price,
     Days,
     ROUND((365 / Days) * Price ,  0) AS Yearly_Projection
FROM jio_plans
ORDER BY Price DESC ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
16 rows affected.

[(2879, 365, Decimal('2879')),
 (2545, 336, Decimal('2765')),
 (1199, 84, Decimal('5210')),
 (666, 84, Decimal('2894')),
 (533, 56, Decimal('3474')),
 (479, 56, Decimal('3122')),
 (419, 28, Decimal('5462')),
 (299, 28, Decimal('3898')),
 (259, 30, Decimal('3151')),
 (249, 23, Decimal('3952')),
 (239, 28, Decimal('3116')),
 (209, 28, Decimal('2724')),
 (199, 23, Decimal('3158')),
 (179, 24, Decimal('2722')),
 (149, 20, Decimal('2719')),
 (119, 14, Decimal('3102'))]

#### 13. How does the average price change as the validity period increases?

In [101]:
%%sql

SELECT 
     Days,
     COUNT(*) AS Total_plans,
     ROUND (AVG(Price), 2) AS Avg_Price
FROM airtel_plans
GROUP BY Days 
ORDER BY Days ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
8 rows affected.

[(21, 1, Decimal('209.00')),
 (24, 2, Decimal('197.00')),
 (28, 10, Decimal('409.60')),
 (30, 2, Decimal('307.50')),
 (56, 3, Decimal('575.67')),
 (77, 1, Decimal('666.00')),
 (84, 5, Decimal('770.20')),
 (365, 4, Decimal('2879.00'))]

#### 14. What is the total data capacity promised by Jio if one buys every plan?

In [102]:
%%sql

SELECT SUM(Data_per_Day * Days) AS Total_Network_Data_Capacity
FROM jio_plans

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
1 rows affected.

[(2208.5,)]

#### 15. What is the most common "Data per Day" offering?

In [103]:
%%sql

SELECT
     Data_per_Day,
     COUNT(*) AS Numper_of_plans
FROM airtel_plans
GROUP BY Data_per_Day
ORDER BY Numper_of_plans DESC ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
6 rows affected.

[(2.0, 9), (2.5, 5), (1.5, 4), (1.0, 4), (3.0, 3), (0.0, 3)]

#### 16. What are the minimum, maximum, and average prices in the market?

In [104]:
%%sql

SELECT 
     MIN(Price) AS MIN_Price,
     MAX(Price) AS MAX_Price,
     AVG(Price) AS AVG_Price
FROM airtel_plans ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
1 rows affected.

[(155, 3359, Decimal('824.0714'))]

#### 17. The Leaderboard: Which top 10 plans are cheapest per day (Across Both)?

In [105]:
%%sql

SELECT 'Jio' AS Provider, Price, Days, Price_Day AS Daily_Cost FROM jio_plans
UNION ALL
SELECT 'Airtel' AS PROVIDER, Price, Days, (Price/Days) AS Daily_Cost FROM airtel_plans 
ORDER BY Daily_Cost ASC 
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
10 rows affected.

[('Airtel', 1799, 365, 4.928767123),
 ('Airtel', 455, 84, 5.416666666),
 ('Airtel', 179, 28, 6.392857142),
 ('Airtel', 155, 24, 6.458333333),
 ('Jio', 149, 20, 7.45),
 ('Jio', 179, 24, 7.458333333),
 ('Jio', 209, 28, 7.464285714),
 ('Jio', 2545, 336, 7.574404762),
 ('Jio', 2879, 365, 7.887671233),
 ('Jio', 666, 84, 7.928571429)]

#### 18. Head-to-Head: How much cheaper is Jio vs Airtel for 84-day plans?

In [106]:
%%sql

SELECT 
     J.Price AS Jio_Price,
     A.Price AS Airtel_Price,
     (A.Price - J.Price) AS Price_Difference
FROM jio_plans J JOIN airtel_plans A ON J.Days = A.Days
WHERE J.Days = 84 ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
10 rows affected.

[(1199, 999, -200),
 (666, 999, 333),
 (1199, 839, -360),
 (666, 839, 173),
 (1199, 719, -480),
 (666, 719, 53),
 (1199, 455, -744),
 (666, 455, -211),
 (1199, 839, -360),
 (666, 839, 173)]

#### 19. Rank Airtel plans by how much data they offer (Highest to Lowest).

In [109]:
%%sql

SELECT 
     Price,
     Data_per_Day,
     RANK() OVER (ORDER BY Data_per_Day DESC) AS Data_Rank
FROM airtel_plans ;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
28 rows affected.

[(699, 3.0, 1),
 (599, 3.0, 1),
 (599, 3.0, 1),
 (3359, 2.5, 4),
 (999, 2.5, 4),
 (399, 2.5, 4),
 (399, 2.5, 4),
 (3359, 2.5, 4),
 (2999, 2.0, 9),
 (839, 2.0, 9),
 (549, 2.0, 9),
 (499, 2.0, 9),
 (359, 2.0, 9),
 (319, 2.0, 9),
 (179, 2.0, 9),
 (839, 2.0, 9),
 (499, 2.0, 9),
 (719, 1.5, 18),
 (666, 1.5, 18),
 (479, 1.5, 18),
 (299, 1.5, 18),
 (265, 1.0, 22),
 (239, 1.0, 22),
 (209, 1.0, 22),
 (155, 1.0, 22),
 (455, 0.0, 26),
 (296, 0.0, 26),
 (1799, 0.0, 26)]

#### 20. Which Jio plans drive the highest profit margins relative to price?

In [111]:
%%sql

SELECT
      Price,
      Profit_per_customer,
      ROUND((Profit_per_customer / Price) * 100 , 2) AS Margin_Percentage
FROM jio_plans 
ORDER BY Margin_Percentage DESC;

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
16 rows affected.

[(249, 1072.521739, 430.73),
 (299, 1018.678571, 340.7),
 (119, 337.8422619, 283.9),
 (199, 393.3857402, 197.68),
 (259, 386.5089286, 149.23),
 (239, 350.8779762, 146.81),
 (533, 595.0178571, 111.64),
 (479, 357.3958333, 74.61),
 (419, 252.0238095, 60.15),
 (666, 129.2708333, 19.41),
 (209, 5.214285714, 2.49),
 (179, 3.041666667, 1.7),
 (149, 0.0, 0.0),
 (2545, 0.0, 0.0),
 (2879, 0.0, 0.0),
 (1199, 0.0, 0.0)]

#### 21. The "Power User" Filter: High Data (>1.5GB) AND Streaming Benefits.

In [113]:
%%sql

SELECT * FROM airtel_plans
WHERE Data_per_Day >= 1.5
AND (Additional_Benefits LIKE '%Disney%'  OR Additional_Benefits LIKE '%Prime%');

 * mysql+mysqlconnector://root:***@localhost:3306/air_vs_jio
13 rows affected.

[(3359, 2.5, 0, 365, 'Disney + Hotstar 1 year'),
 (999, 2.5, 0, 84, 'Amazon prime membership'),
 (839, 2.0, 0, 84, 'Disney + Hotstar 3 Months'),
 (699, 3.0, 0, 56, 'Amazon prime membership'),
 (599, 3.0, 0, 28, 'Disney + Hotstar 1 year'),
 (499, 2.0, 0, 28, 'Disney + Hotstar 1 year'),
 (399, 2.5, 0, 28, 'Disney + Hotstar 3 Months'),
 (359, 2.0, 0, 28, 'Prime video mobile edition'),
 (399, 2.5, 0, 28, 'Disney + Hotstar 3 Months'),
 (839, 2.0, 0, 84, 'Disney + Hotstar 3 Months'),
 (499, 2.0, 0, 28, 'Disney + Hotstar 1 year'),
 (599, 3.0, 0, 28, 'Disney + Hotstar 1 year'),
 (3359, 2.5, 0, 365, 'Disney + Hotstar 1 year')]